immutable_var = 1, 2, 3, '4', True
print(immutable_var)
immutable_var[0] = 8  # ошибка буквально сообщает нам, что кортеж не поддерживает обращение по элементам.
mutable_list = ['1', '2', 3, False]
mutable_list[0] = 8
print(mutable_list)
# Замечание преподавателя
# Здравствуйте, проверил ваше решение, всё верно.
# Да, но причина неизменности в том, что кортежи неизменяемый
# тип данных, а не потому, что мы не можем обратиться по индексу, т.к. у
# множеств мы тоже не сможем обратиться по индексу, а изменить их(элементы) можно