dz_num = 12
time_spent = 1.5
course_name = 'Python'
time_for_one_task = time_spent * 60 / dz_num
print(
    f'Курс: {course_name}, Всего задач: {dz_num}, Затрачено часов: {time_spent}, Среднее время выполнения: {time_for_one_task}.')
# Здравствуйте, проверил вашу работу, всё отлично.
# Продолжайте в том же духе! :)
# Немного советов:
# Последнюю строку лучше форматировать подобным образом: (Ссылку на статью о том, как такое сделать прикрепил в полезные материалы)
# print(f'Курс: {course_name}, всего задач: {dz_num},'
# f' затрачено часов: {time_spent}, среднее время выполнения {time_for_one_task} часа.')
# Чтобы она не была сильно длинной.
